//#include <stdio.h>
//#include <stdlib.h>
//#include <malloc.h>
//
//
//int main(void)
//{
//	//int (*p)[5] = (int(*)[5])malloc(sizeof(int) * 5);
//
//	//
//	//int a[5];
//
//	//int (*p1)[5] = &a;
//
//	//int i = 0;
//
//	//*(*p+0) = 1;  // a+0
//	//*(*p+1) = 2;  // a+1   数组名字是数组首元素的首地址   *(p+n) == p[n]   一个指针指向一个变量或者一块空间，*这个指针就是这个变量 或者 空间本身
//	//*(*p+2) = 3;
//	//*(*p+3) = 4;
//	//*(*p+4) = 5;
//
//
//	//for (i = 0; i < 5; i++)
//	//{
//	//	printf ("%d ", (*p)[i]);
//	//}
//
//	int (*p)[2][3] = (int(*)[2][3])malloc(sizeof(int) * 2 * 3);
//
//	int a[2][3];
//
//	int (*p1)[2][3] = &a;
//
//	//*p1 == a;
//	//*p == a;
//
//	int i = 0,
//		j = 0;
//
//	(*p)[0][0] = 1;  // a+0
//	(*p)[0][1] = 1; // a+1   数组名字是数组首元素的首地址   *(p+n) == p[n]   一个指针指向一个变量或者一块空间，*这个指针就是这个变量 或者 空间本身
//	*(*(*p+0) + 2) = 1;
//	(*p)[1][0] = 1;
//	(*p)[1][1] = 1;
//	(*p)[1][2] = 1;
//
//
//	for (i = 0; i < 2; i++)
//	{
//		for (j = 0; j < 3; j++)
//		{
//		    printf ("%d ", (*p)[i][j]);
//		}
//	}
//
//	free(p);
//
//	system("pause");
//	return 0;
//}